LEVEL_UP_HP = 3

LEVEL_UP_ATTACK_ARMOUR = 1

LEVEL_UP_MONEY = 5
HELP_MESSAGE = f"""
Привет!
Это недодота.
Тут есть локации
    1. Город [База, потайная лавка]
    2. Подземелье [Все остальное]
В подземелье можно заработать бабосики и опыт.
В городе можно купить/продать снаряжение + восполнить пул хп и маны.
В Базе продаются снаряжение ниже 5го тира. Все выше продается в лавке 
При повышении уровня максимальное здоровье повышается на {LEVEL_UP_HP}, атака и 
броня повышаются на {LEVEL_UP_ATTACK_ARMOUR} (как физическая, так и магическая). Так же при повышении 
уровня даётся {LEVEL_UP_MONEY} монет. 
При победе над монстром рандомно выдаются монеты, опыт и один предмет. 

/help - помощь
/stats - прислать статистику игрока
/locations - локации
/inventory - инвентарь
/move - переместиться
/items - купить/продать предмет
/put\\_on - надеть вещь
/take\\_off - снять вещь
/start - начать игру
"""

HELLO_TEXT = 'Привет!\n' \
             'Герой создан!\n ' \
             'Ты получил бонусные предметы' \
             'Подробности и правила игры: /help\n'
UNKNOWN_TEST = 'pipip, читай /help'
FORBIDDEN_TEXT = "[Подземелье] Действие недоступно!\n"
EMPTY_INVENTORY_TEXT = "Пустота....\n"
NO_GARMENTS_TEXT = "В инвентаре нет оружия и одежды\n"
NO_POTION_TEXT = "В инвентаре нет зелий"
OR_ALL_ITEMS_ARE_USED_TEXT = "или все предметы используются"
OR_ALL_ITEMS_ARE_NOT_USED_TEXT = "или все предметы не используются"
CHOOSE_ITEM_TO_USE_TEXT = 'Выбери предмет, который хочешь использовать'
CHOOSE_ITEM_TO_TAKE_OFF_TEXT = 'Выбери предмет, который хочешь снять'
CHOOSE_ITEM_TO_BUY_TEXT = "Выбери предмет для покупки"
CHOOSE_ITEM_TO_SELL_TEXT = "Выбери предмет для продажи"
ITEM_IS_IN_USE_TEXT = "*Предмет* используется"
ITEM_IS_NOT_IN_USE_TEXT = "*Предмет* не используется!"
SUCCESSFUL_SALE_TEXT = "*Успешная продажа*"
SUCCESSFUL_PURCHASE_TEXT = "*Успешная покупка! Не забудь надеть меч/одежду!*"
SUCCESSFUL_POTION_USE_TEXT = "Зелье успешно выпито!"
TAKE_OFF_ITEM_TEXT = "Перед продажей нужно снять предмет!"
NO_ITEMS_FOR_SALE_TEXT = "Нет предметов для продажи!"
NOT_ENOUGH_MONEY_TEXT = "Недостаточно средств!"
NOT_ENOUGH_LEVEL_TEXT = "Недостаточный уровень!"
TURN_TEXT = "Твой ход!"
END_TEXT = "Ты умер, игра начнётся заново!"
NEW_HP_TEXT = "Монстр атаковал, твоё текущее здоровье"
MISS_TURN_TEXT = "В инвентаре нет нужных предметов, ход потрачен!"
WHAT_POTION_TO_USE_TEXT = "Какое зелье выпить?"
CHOOSE_ATTACK_TYPE_TEXT = "Выбери типа атаки"
MOB_REMAIN_HP_TEXT = "Ты атаковал, текущее здоровье монстра"
WIN_TEXT = "ПОБЕДА!"
WIN_ITEM_ID_TEXT = "Получен предмет с ID"
WIN_MONEY_TEXT = "Получено монет"
UPDATE_LEVEL_TEXT = "Уровень повышен на"
BUY_TEXT = "Купить"
SELL_TEXT = "Продать"
GET_MOB_INFO_TEXT = "Получить информацию о монстре"
DRINK_POTION_TEXT = "Выпить зелье"
ATTACK_TEXT = "Атаковать"


def create_duration_text(to, duration):
    return f"Идём в {to}. Путь займёт {duration} секунд(ы)"


BASE_ARRIVAL_TEXT = "Прибыли в базу, " \
                    "в базе продаются снаряжение ниже 5го тира. Все выше продается в лавке . Здоровье восстановлено!"
HIDDEN_ARRIVAL_TEXT = "Прибыли в потайную лавку, здесь продаются снаряжение выше 5го тира. Здоровье восстановлено!"

ROSHAN_ARRIVAL_TEXT = "Прибыли в рошан, сражение начинается!"
WOOD_ARRIVAL_TEXT = "Прибыли в лес, сражение начинается!"
